In [1]:
import sqlite3 as sql

In [2]:
conn = sql.connect('indira.db')

In [3]:
cursor = conn.cursor()

In [4]:
cursor.execute('''
create table if not exists students(id integer primary key,
    name text not null,
    age integer not null)
''')

In [5]:
def show_tables():
    cursor.execute(''' select name from sqlite_master where type="table" ''')
    return cursor.fetchall()

print(show_tables())

[('students',)]

In [6]:
cursor.execute(''' insert into students values(100, "Alice", 22) ''')

In [7]:
def show_records(table_name):
    cursor.execute(''' select * from {} '''.format(table_name))
    return cursor.fetchall()

print(show_records('students'))

[(100, 'Alice', 22)]

In [8]:
_id = 101
_name = 'Bob'
_age = 23

cursor.execute('''insert into students values(?, ?, ?)''', (_id, _name, _age))

In [9]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23)]

In [10]:
students = [(103, "Charles", 21), (104, "David", 20), (105, "Eugene", 24)]

cursor.executemany(''' insert into students values(?, ?, ?) ''', students)

In [11]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eugene', 24)]

In [12]:
cursor.execute(''' update students set name = "Eklavya" where id = 105 ''')

In [13]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eklavya', 24)]

In [14]:
cursor.execute(''' select name, age from students''')

In [15]:
cursor.fetchone()

('Alice', 22)

In [16]:
cursor.fetchone()

('Bob', 23)

In [17]:
cursor.fetchone()

('Charles', 21)

In [18]:
cursor.fetchone()

('David', 20)

In [19]:
cursor.fetchone()

('Eklavya', 24)

In [20]:
cursor.fetchone()

In [21]:
cursor.execute(''' select name, age from students''')

In [22]:
cursor.fetchall()

[('Alice', 22), ('Bob', 23), ('Charles', 21), ('David', 20), ('Eklavya', 24)]

In [23]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eklavya', 24)]

In [24]:
cursor.execute(''' delete from students where id = 100 ''')

In [25]:
print(show_records('students'))

[(101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eklavya', 24)]

In [26]:
conn.commit()

In [27]:
conn.close()

sql to pandas

In [28]:
import pandas as pd
import numpy as np

In [29]:
conn = sql.connect("indira.db")

In [30]:
cursor = conn.cursor()

In [31]:
data = pd.read_sql_query(" select * from students ", con=conn)

In [32]:
data

    id     name  age
0  101      Bob   23
1  103  Charles   21
2  104    David   20
3  105  Eklavya   24

In [33]:
data1 = pd.DataFrame(np.random.randint(2, 15, (5,3)), columns=['A','B','C']) 
data1

    A   B   C
0  13   3  14
1   9   7   3
2  11   4   8
3   3  13  10
4  10   3   2

In [34]:
data1.to_sql("Random", con=conn)

In [35]:
print(show_tables())

[('students',), ('Random',)]

In [36]:
print(show_records('Random'))

[(0, 13, 3, 14), (1, 9, 7, 3), (2, 11, 4, 8), (3, 3, 13, 10), (4, 10, 3, 2)]

In [37]:
cursor.execute(''' select A, C from Random''')

In [39]:
cursor.fetchall()

[]

In [38]:
print(show_records('Random'))

[(0, 13, 3, 14), (1, 9, 7, 3), (2, 11, 4, 8), (3, 3, 13, 10), (4, 10, 3, 2)]

In [40]:
cursor.execute(''' select B, C from Random''')

In [41]:
cursor.fetchall()

[(3, 14), (7, 3), (4, 8), (13, 10), (3, 2)]